OpenNuvoton/M253BSP/Library/Device/Nuvoton/M253/Include/canfd_reg.h
    __IO uint32_t TEST;                 /*!< [0x0010] Test Register                                                    */
    __IO uint32_t RWD;                  /*!< [0x0014] RAM Watchdog                                                     */
    __IO uint32_t CCCR;                 /*!< [0x0018] CC Control Register                                              */
    __IO uint32_t NBTP;                 /*!< [0x001c] Nominal Bit Timing & Prescaler Register                          */
    __IO uint32_t TSCC;                 /*!< [0x0020] Timestamp Counter Configuration                                  */
    __IO uint32_t TSCV;                 /*!< [0x0024] Timestamp Counter Value                                          */
    __IO uint32_t TOCC;                 /*!< [0x0028] Timeout Counter Configuration                                    */
    __IO uint32_t TOCV;                 /*!< [0x002c] Timeout Counter Value                                            */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE1[4];
    /// @endcond //HIDDEN_SYMBOLS
    __I  uint32_t ECR;                  /*!< [0x0040] Error Counter Register                                           */
    __I  uint32_t PSR;                  /*!< [0x0044] Protocol Status Register                                         */
    __IO uint32_t TDCR;                 /*!< [0x0048] Transmitter Delay Compensation Register                          */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE2[1];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t IR;                   /*!< [0x0050] Interrupt Register                                               */
    __IO uint32_t IE;                   /*!< [0x0054] Interrupt Enable                                                 */
    __IO uint32_t ILS;                  /*!< [0x0058] Interrupt Line Select                                            */
    __IO uint32_t ILE;                  /*!< [0x005c] Interrupt Line Enable                                            */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE3[8];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t GFC;                  /*!< [0x0080] Global Filter Configuration                                      */
    __IO uint32_t SIDFC;                /*!< [0x0084] Standard ID Filter Configuration                                 */
    __IO uint32_t XIDFC;                /*!< [0x0088] Extended ID Filter Configuration                                 */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE4[1];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t XIDAM;                /*!< [0x0090] Extended ID AND Mask                                             */
    __I  uint32_t HPMS;                 /*!< [0x0094] High Priority Message Status                                     */
    __IO uint32_t NDAT1;                /*!< [0x0098] New Data 1                                                       */
    __IO uint32_t NDAT2;                /*!< [0x009c] New Data 2                                                       */
    __IO uint32_t RXF0C;                /*!< [0x00a0] Rx FIFO 0 Configuration                                          */
    __IO uint32_t RXF0S;                /*!< [0x00a4] Rx FIFO 0 Status                                                 */
    __IO uint32_t RXF0A;                /*!< [0x00a8] Rx FIFO 0 Acknowledge                                            */
    __IO uint32_t RXBC;                 /*!< [0x00ac] Rx Buffer Configuration                                          */
    __IO uint32_t RXF1C;                /*!< [0x00b0] Rx FIFO 1 Configuration                                          */
    __IO uint32_t RXF1S;                /*!< [0x00b4] Rx FIFO 1 Status                                                 */
    __IO uint32_t RXF1A;                /*!< [0x00b8] Rx FIFO 1 Acknowledge                                            */
    __IO uint32_t RXESC;                /*!< [0x00bc] Rx Buffer / FIFO Element Size Configuration                      */
    __IO uint32_t TXBC;                 /*!< [0x00c0] Tx Buffer Configuration                                          */
    __IO uint32_t TXFQS;                /*!< [0x00c4] Tx FIFO/Queue Status                                             */
    __IO uint32_t TXESC;                /*!< [0x00c8] Tx Buffer Element Size Configuration                             */
    __IO uint32_t TXBRP;                /*!< [0x00cc] Tx Buffer Request Pending                                        */
    __IO uint32_t TXBAR;                /*!< [0x00d0] Tx Buffer Add Request                                            */
    __IO uint32_t TXBCR;                /*!< [0x00d4] Tx Buffer Cancellation Request                                   */
    __IO uint32_t TXBTO;                /*!< [0x00d8] Tx Buffer Transmission Occurred                                  */
    __IO uint32_t TXBCF;                /*!< [0x00dc] Tx Buffer Cancellation Finished                                  */
    __IO uint32_t TXBTIE;               /*!< [0x00e0] Tx Buffer Transmission Interrupt Enable                          */
    __IO uint32_t TXBCIE;               /*!< [0x00e4] Tx Buffer Cancellation Finished Interrupt Enable                 */
    /// @cond HIDDEN_SYMBOLS
    __I  uint32_t RESERVE5[2];
    /// @endcond //HIDDEN_SYMBOLS
    __IO uint32_t TXEFC;                /*!< [0x00f0] Tx Event FIFO Configuration                                      */
    __IO uint32_t TXEFS;                /*!< [0x00f4] Tx Event FIFO Status                                             */
    __IO uint32_t TXEFA;                /*!< [0x00f8] Tx Event FIFO Acknowledge                                        */
} CANFD_T;

/**
    @addtogroup CANFD_CONST CANFD Bit Field Definition
    Constant Definitions for CANFD Controller
@{ */

#define CANFD_DBTP_DSJW_Pos              (0)                                               /*!< CANFD_T::DBTP: DSJW Position           */
#define CANFD_DBTP_DSJW_Msk              (0xful << CANFD_DBTP_DSJW_Pos)                    /*!< CANFD_T::DBTP: DSJW Mask               */

#define CANFD_DBTP_DTSEG2_Pos            (4)                                               /*!< CANFD_T::DBTP: DTSEG2 Position         */
#define CANFD_DBTP_DTSEG2_Msk            (0xful << CANFD_DBTP_DTSEG2_Pos)                  /*!< CANFD_T::DBTP: DTSEG2 Mask             */

#define CANFD_DBTP_DTSEG1_Pos            (8)                                               /*!< CANFD_T::DBTP: DTSEG1 Position         */
#define CANFD_DBTP_DTSEG1_Msk            (0x1ful << CANFD_DBTP_DTSEG1_Pos)                 /*!< CANFD_T::DBTP: DTSEG1 Mask             */

#define CANFD_DBTP_DBRP_Pos              (16)                                              /*!< CANFD_T::DBTP: DBRP Position           */
#define CANFD_DBTP_DBRP_Msk              (0x1ful << CANFD_DBTP_DBRP_Pos)                   /*!< CANFD_T::DBTP: DBRP Mask               */

#define CANFD_DBTP_TDC_Pos               (23)                                              /*!< CANFD_T::DBTP: TDC Position            */
#define CANFD_DBTP_TDC_Msk               (0x1ul << CANFD_DBTP_TDC_Pos)                     /*!< CANFD_T::DBTP: TDC Mask                */

